{
  "projects": [
    {
      "id": 1,
      "name": "2D Platformer",
      "date": "Year 10 (2020)",
      "fullDescription": "This was my first major programming project during Year 10 as a practice for my NEA in year 11. I really wanted to do something with PyGame as I found it would be fun to make a 2D game which would keep me interested when programming it at home and learning PyGame at the same time.\n\nDuring the learning process I started with the basics of PyGame by changing the colour of the background and making some simple shapes which changes colour, then after watching some TechWithTim videos I learnt how to create characters using classes and implement gravity with functions.\n\nWhen starting with the project I wanted to focus more on user experience than graphics so I started with both the player and enemy classes and implemented a jump function, after I learnt how to add hitboxes to shapes so I could add floors for the character to sit on, also created by classes which made it easy to make multiple of them for the game. Hitboxes were interesting to learn as it would check if anything was past the first wall and before the second, both horizontally and vertically, it was difficult to keep track of which wall was which but after making one hitbox checker it was easy to replicate with other characters and other hitboxes.\n\nAfter, I implemented scoring and lives with .blit() and by adding them as variables to the constructors of the player and enemy classes then, I added selection statement which made it so the user gains a point if they collide with the star and lose a life if the enemy collides with them. Finally after adding a start screen and an end screen which trigger if the user has no more lives the project was finished.\n\nOverall I was pretty happy with how the project went, especially since it was my first “big” project that I had the control and creativity of to design and implement the programming of and if I were to go back and add/fix some elements I would do the following.\n\nMusic: I wanted to add some basic music/sound effects to make the game more engaging but after trying with pygame.mixer I couldn’t figure it out and get the music to play. This was more of a side feature though so I only spent a couple of hours trying to figure it out.\n\nJump function: The function is very laggy and weird with both the user and enemy, the enemy jumps the same time as the player and they jump and fall far too quickly which even messes with the hitboxes sometimes. Ultimately messing with the experience of the game and making it more difficult/confusing to play, with the way the jump function works I could try and decrease the jumps height or make another variable called gravity and set it to a very small value making the characters fall slower.\n\nFloors: There were far too many floors to keep track of with hitboxes and I ended up having around 100 lines of code for checking when the player or enemy would collide with them, this was obviously inefficient at the time and looking back I could have very easily put all the floors in a list and then loop through that list to look for collisions, I have added this another project I did and it worked out much nicer and simpler than the current solution in this project.\n\nAttacks: I tried to add a shooting feature to the characters where they would throw shooting stars/daggers at each other with another button as I thought it would be a cool feature for users to enjoy but after many trials and errors I decided to scrap the idea mainly because the enemy was acting too random for them to accurate with their weapon and because it would most likely make the game too easy for the player if they just keep killing the enemy.",
      "skills": ["Python", "Pygame", "Object-Oriented Programming", "Event handling", "Hitboxes", "Scoring"],
      "images": ["../assets/thumbnails/projectspictures/2d-platformer-1.png", "../assets/thumbnails/projectspictures/2d-platformer-2.png"],
      "githubUrl": "https://github.com/SameerUH/2D-Platformer",
      "slugUrl": "2d-platformer"
    },
    {
      "id": 2,
      "name": "NEA Maze Game",
      "date": "Year 11 (2021)",
      "fullDescription": "NEA project for A-Level Computer Science, decided to make a game similar to Pac-Man and to my last project where there would be 2 characters, a scoring system and obstacles to avoid. Given that I had done last years project in PyGame, it allowed me to add more complicated challenges to this project such as algorithms and screens.\n\nWhen starting with the project I first implemented what I had learnt last time and created classes for the player, enemy, star and walls, a lot of this was trial and error to mess with the sizing of the objects but I decided to keep it simple with the design of the game.\n\nWith learning from my last project, I decided to put all of the walls in a list which the collision detection system way easier and quicker to implement, as instead of replicating 1 function for 13 walls, I could simply loop through the list and detect it then. After I worked on the scoring and lives system again using the .blit() function to have it display on the screen and storing it in the constructors of classes. To start focusing on more advanced features, I wanted to improve the enemy class to make it more realistic and challenging for the user rather than the mess I created last project. I learnt a couple of pathfinding algorithms such as Djikstra’s and A* to see if I can have the enemy predict where the player would be and track it. I added some white nodes across the map which aren’t visible to the user and kept track of the distances between the player and all those nodes, whichever node was closest would be the one the enemy would go to.\n\nI managed to get the theory to work with tracking the nodes and having the enemy move but there were some small issues that were too confusing to solve, so I ended up making a final decision to have the enemy move randomly between the nodes. This did cause a fun challenge for the user as the enemy became less difficult to predict making the user focus more on the game but it was unfortunate to not get the algorithm to work.\n\nAdding different screens was a cool experience, I made a class for buttons which changes boolean variables which act as game states. Only one game state can be true and they display different buttons every time. The classes were easy to make as they were easy rectangles but positioning the buttons took some time with trial and error.\n\nThe settings screen complicated to make given that I had to think of different features the user can change but I made colourblind settings for accessibility, speed settings for user preference and a “hardmode” button for difficulty, basically makes it so if you touch a wall you lose a life.\n\nOverall I was very happy with this project if had more time then I would improve the following, I could redo the pathfinding algorithm to make it more accurate and realistic, I do think my previous attempt would have worked if I implemented some selection statements that remove the logic errors. The gameplay itself is fine but I do think there are other features I can implement to improve experience such as a scoreboard, full screen button with .display(), music with .mixer(), etc.",
      "skills": ["Python", "Pygame", "Algorithms"],
      "images": ["../assets/thumbnails/projectspictures/nea-maze-game-1.png", "../assets/thumbnails/projectspictures/nea-maze-game-2.png"],
      "githubUrl": "https://github.com/SameerUH/NEA-Maze-Game",
      "slugUrl": "nea-maze-game"
    },
    {
      "id": 3,
      "name": "Productivity App",
      "date": "1st Year (2022)",
      "fullDescription": "A comprehensive task management application built during my first year at university.\nFeatures include task creation and categorization, deadline tracking, progress visualization, and productivity analytics.\nThe app uses a clean, intuitive interface designed to help students manage their academic workload effectively.\nBuilt with modern web technologies and responsive design principles.",
      "skills": ["HTML", "CSS", "JavaScript", "Responsive Design"],
      "images": ["../assets/thumbnails/projectspictures/productivity-app.png", "../assets/thumbnails/projectspictures/productivity-app-2.png"],
      "githubUrl": "https://github.com/SameerUH/Productivity-app",
      "slugUrl": "productivity-app"
    },
    {
      "id": 4,
      "name": "Pong",
      "date": "2025",
      "fullDescription": "Pong in my own interpretation/implementation",
      "skills": ["Python", "PyGame", "Object-Oriented Programming", "Enemy Computer"],
      "images": ["../assets/thumbnails/projectspictures/pong-image.png", "../assets/thumbnails/projectspictures/pong-image-2.png"],
      "githubUrl": "https://github.com/SameerUH/Pong",
      "slugUrl": "pong"
    },
    {
      "id": 5,
      "name": "Gratithink (Website)",
      "date": "2nd Year (2025)",
      "fullDescription": "GratiThink is a web and mobile app that helps students build a positive mindset through daily gratitude journaling. It encourages users to reflect on meaningful moments, track their progress, and develop a habit of mindfulness in an easy-to-use, student-friendly interface.\nThe project was developed using HTML, CSS, PHP, and JavaScript for the website and React.js for the mobile version. It showcases full-stack development skills and thoughtful design focused on simplicity, accessibility, and personal growth.",
      "skills": ["HTML", "CSS", "JavaScript", "React.js", "Tailwind CSS", "Wireframes", "Responsive Design"],
      "images": ["../assets/thumbnails/projectspictures/gratithink-webimage.png", "../assets/thumbnails/projectspictures/gratithink-webimage-2.png"],
      "githubUrl": "https://github.com/SameerUH/GratiThink-Website,https://github.com/SameerUH/Gratithink-app",
      "slugUrl": "gratithink-website"
    },
    { "id": 6,
      "name": "Gratithink (App)",
      "date": "2nd Year (2025)",
      "fullDescription": "GratiThink is a web and mobile app that helps students build a positive mindset through daily gratitude journaling. It encourages users to reflect on meaningful moments, track their progress, and develop a habit of mindfulness in an easy-to-use, student-friendly interface.\nThe project was developed using HTML, CSS, PHP, and JavaScript for the website and React.js for the mobile version. It showcases full-stack development skills and thoughtful design focused on simplicity, accessibility, and personal growth.",
      "skills": ["HTML", "CSS", "JavaScript", "React.js", "Tailwind CSS", "Wireframes", "Responsive Design"],
      "images": ["../assets/thumbnails/projectspictures/gratithink-appimage.png", "../assets/thumbnails/projectspictures/gratithink-appimage-2.png"],
      "githubUrl": "https://github.com/SameerUH/GratiThink-Website,https://github.com/SameerUH/Gratithink-app",
      "slugUrl": "gratithink-app"}
  ]
}