{
  "projects": [
    {
      "id": 1,
      "name": "2D Platformer",
      "date": "Year 10 (2020)",
      "fullDescription": "This was my first major programming project during Year 10.\nBuilt using Python and Pygame, it features multiple levels, enemy AI, power-ups, and a scoring system.\nThe game includes custom sprite animations, collision detection, and progressive difficulty.\nThis project taught me fundamental game development concepts and object-oriented programming principles.",
      "skills": ["Python", "Pygame", "Object-Oriented Programming"],
      "image": "../assets/thumbnails/gratithink-thumnbail.png",
      "gallery": [
        "/images/projects/2d-platformer-1.png",
        "/images/projects/2d-platformer-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/2D-Platformer"
    },
    {
      "id": 2,
      "name": "NEA Maze Game",
      "date": "Year 11 (2021)",
      "fullDescription": "Developed as my Non-Exam Assessment (NEA) project for A-Level Computer Science.\nThis Pac-Man inspired maze game features ghost AI with different behaviors, power pellets, score tracking, and multiple mazes.\nThe project included comprehensive documentation, user testing, and iterative development following the software development lifecycle.",
      "skills": ["Python", "Pygame", "Algorithms"],
      "image": "/images/projects/nea-maze.png",
      "githubUrl": "https://github.com/SameerUH/NEA-Maze-Game"
    },
    {
      "id": 3,
      "name": "Productivity App",
      "date": "1st Year (2022)",
      "fullDescription": "A comprehensive task management application built during my first year at university.\nFeatures include task creation and categorization, deadline tracking, progress visualization, and productivity analytics.\nThe app uses a clean, intuitive interface designed to help students manage their academic workload effectively.\nBuilt with modern web technologies and responsive design principles.",
      "skills": ["HTML", "CSS", "JavaScript", "Responsive Design"],
      "image": "/images/projects/productivity-app.png",
      "githubUrl": "https://github.com/SameerUH/Productivity-app"
    },
    {
      "id": 4,
      "name": "Gratithink",
      "date": "2nd Year (2025)",
      "fullDescription": "GratiThink is a web and mobile app that helps students build a positive mindset through daily gratitude journaling. It encourages users to reflect on meaningful moments, track their progress, and develop a habit of mindfulness in an easy-to-use, student-friendly interface.\nThe project was developed using HTML, CSS, PHP, and JavaScript for the website and React.js for the mobile version. It showcases full-stack development skills and thoughtful design focused on simplicity, accessibility, and personal growth.",
      "skills": ["HTML", "CSS", "JavaScript", "React.js", "Tailwind CSS", "Wireframes", "Responsive Design"],
      "image": "/images/projects/gratithink-image.png",
      "githubUrl": "https://github.com/SameerUH/GratiThink-Website,https://github.com/SameerUH/Gratithink-app"
    }
  ]
}