{
  "projects": [
    {
      "id": 1,
      "name": "2D Platformer",
      "date": "Year 10 (2020)",
      "fullDescription": "This was my first major programming project during Year 10 as a practice for my NEA in year 11. I really wanted to do something with PyGame as I found it would be fun to make a 2D game which would keep me interested when programming it at home and learning PyGame at the same time.\n\nDuring the learning process I started with the basics of PyGame by changing the colour of the background and making some simple shapes which changes colour, then after watching some TechWithTim videos I learnt how to create characters using classes and implement gravity with functions.\n\nWhen starting with the project I wanted to focus more on user experience than graphics so I started with both the player and enemy classes and implemented a jump function, after I learnt how to add hitboxes to shapes so I could add floors for the character to sit on, also created by classes which made it easy to make multiple of them for the game. Hitboxes were interesting to learn as it would check if anything was past the first wall and before the second, both horizontally and vertically, it was difficult to keep track of which wall was which but after making one hitbox checker it was easy to replicate with other characters and other hitboxes.\n\nAfter, I implemented scoring and lives with .blit() and by adding them as variables to the constructors of the player and enemy classes then, I added selection statement which made it so the user gains a point if they collide with the star and lose a life if the enemy collides with them. Finally after adding a start screen and an end screen which trigger if the user has no more lives the project was finished.\n\nOverall I was pretty happy with how the project went, especially since it was my first “big” project that I had the control and creativity of to design and implement the programming of and if I were to go back and add/fix some elements I would do the following.\n\nMusic: I wanted to add some basic music/sound effects to make the game more engaging but after trying with pygame.mixer I couldn't figure it out and get the music to play. This was more of a side feature though so I only spent a couple of hours trying to figure it out.\n\nJump function: The function is very laggy and weird with both the user and enemy, the enemy jumps the same time as the player and they jump and fall far too quickly which even messes with the hitboxes sometimes. Ultimately messing with the experience of the game and making it more difficult/confusing to play, with the way the jump function works I could try and decrease the jumps height or make another variable called gravity and set it to a very small value making the characters fall slower.\n\nFloors: There were far too many floors to keep track of with hitboxes and I ended up having around 100 lines of code for checking when the player or enemy would collide with them, this was obviously inefficient at the time and looking back I could have very easily put all the floors in a list and then loop through that list to look for collisions, I have added this another project I did and it worked out much nicer and simpler than the current solution in this project.\n\nAttacks: I tried to add a shooting feature to the characters where they would throw shooting stars/daggers at each other with another button as I thought it would be a cool feature for users to enjoy but after many trials and errors I decided to scrap the idea mainly because the enemy was acting too random for them to accurate with their weapon and because it would most likely make the game too easy for the player if they just keep killing the enemy.",
      "skills": [
        "Python",
        "Pygame",
        "Object-Oriented Programming",
        "Event handling",
        "Hitboxes",
        "Scoring"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/2d-platformer-1.png",
        "../assets/thumbnails/projectspictures/2d-platformer-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/2D-Platformer",
      "slugUrl": "2d-platformer"
    },
    {
      "id": 2,
      "name": "NEA Maze Game",
      "date": "Year 11 (2021)",
      "fullDescription": "NEA project for A-Level Computer Science, decided to make a game similar to Pac-Man and to my last project where there would be 2 characters, a scoring system and obstacles to avoid. Given that I had done last years project in PyGame, it allowed me to add more complicated challenges to this project such as algorithms and screens.\n\nWhen starting with the project I first implemented what I had learnt last time and created classes for the player, enemy, star and walls, a lot of this was trial and error to mess with the sizing of the objects but I decided to keep it simple with the design of the game.\n\nWith learning from my last project, I decided to put all of the walls in a list which the collision detection system way easier and quicker to implement, as instead of replicating 1 function for 13 walls, I could simply loop through the list and detect it then. After I worked on the scoring and lives system again using the .blit() function to have it display on the screen and storing it in the constructors of classes. To start focusing on more advanced features, I wanted to improve the enemy class to make it more realistic and challenging for the user rather than the mess I created last project. I learnt a couple of pathfinding algorithms such as Djikstra's and A* to see if I can have the enemy predict where the player would be and track it. I added some white nodes across the map which aren't visible to the user and kept track of the distances between the player and all those nodes, whichever node was closest would be the one the enemy would go to.\n\nI managed to get the theory to work with tracking the nodes and having the enemy move but there were some small issues that were too confusing to solve, so I ended up making a final decision to have the enemy move randomly between the nodes. This did cause a fun challenge for the user as the enemy became less difficult to predict making the user focus more on the game but it was unfortunate to not get the algorithm to work.\n\nAdding different screens was a cool experience, I made a class for buttons which changes boolean variables which act as game states. Only one game state can be true and they display different buttons every time. The classes were easy to make as they were easy rectangles but positioning the buttons took some time with trial and error.\n\nThe settings screen complicated to make given that I had to think of different features the user can change but I made colourblind settings for accessibility, speed settings for user preference and a “hardmode” button for difficulty, basically makes it so if you touch a wall you lose a life.\n\nOverall I was very happy with this project if had more time then I would improve the following, I could redo the pathfinding algorithm to make it more accurate and realistic, I do think my previous attempt would have worked if I implemented some selection statements that remove the logic errors. The gameplay itself is fine but I do think there are other features I can implement to improve experience such as a scoreboard, full screen button with .display(), music with .mixer(), etc.",
      "skills": [
        "Python",
        "Pygame",
        "Algorithms"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/nea-maze-game-1.png",
        "../assets/thumbnails/projectspictures/nea-maze-game-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/NEA-Maze-Game",
      "slugUrl": "nea-maze-game"
    },
    {
      "id": 3,
      "name": "Productivity App",
      "date": "1st Year (2022)",
      "fullDescription": "Made this web app using Flask (Python) during my first year of university with the goal of making student lives easier when balancing education with external tasks. Learnt Flask during the project and how to use functions to render pages, POST and GET requests with forms and different URL routes. First time using Flask which was an interesting experience, pretty happy with how the functions went and the user experience but there were some issues I wish I could have implemented and I wish the colour scheme/design was a bit better.\n\nDuring the learning process I did some research and practice using Flask's documentation to make a simple page with a form for user input, it was pretty easy and cool to see how it worked so I decided to start the project and learn as I go. Starting with the login page for authentication and as a test to see if I can redirect URL to load another page, this was slightly confusing at first as I had to use forms for inputs so the user could log in.\n\nMade a bunch of pages with HTML and the styles tag with CSS, I didn't do separate CSS files mainly because it would be too many files to keep track of. The HTML was short and easy to make and plan as well as the CSS as they all had the same colour schemes and repeating features, so most pages were around 50 - 200 lines of code long, the new elements I had learnt were adding GET/POST methods to forms and tables and passing variables with curly brackets {}. In total I made 11 pages of basic HTML and did most of the functionality in Python.\n\nTo help store the user's data I made a class with an update method and a constant object that stores a username, password, email, notifications (boolean) and number of tasks. The object then stores user inputs such as log ons and compares it with the users.txt file for authentication, writing to user.txt if they are registering an account or for displaying statistics/data on the web pages. Displaying statistics/data took up most of the time and code given that I couldn't figure out an efficient method to replace multiple elements of HTML tables with stuff like tasks and dates, this was quite a common occurrence where I just repeated sections of code and replaced what they would affect. The update method was used quite often as when removing or adding information such as passwords, tasks, settings, etc, you have to keep updating at the end of each section to make sure it's up to date. \n\nI decided to use CSV files (slightly) to act as a database for users, this was a small and quick method as opposed to creating a large database for a small assignment on an app like Microsoft Access. With CSV files I could store them as .txt files and use backticks (`) or commas (,) to separate them then in Python I opened them and used the .split() and .strip() functions to treat it as a table. The reason I couldn't use actual commas was for notes.txt as if the note itself included commas it would confuse the backend into thinking it's a new note. Opening and writing/appending to the .txt files was pretty easy to implement, it was a slight struggle figuring out how to store the inputs of forms on front end (i.e. creating notes and tasks) into variables and then converting them to a CSV style format for the .txt files. To convert the input and store them in storage I ended up using f-strings when writing them to the file while using the request.form method to store HTML inputs.\n\nThe notes and settings pages were probably the most rushed part of the assignment mainly due to the amount of time I had left with but the main points are you can create, store, delete and edit up to 10 notes, and you can change your notifications settings and password in the settings page. The design was pretty simple to make as it was just a form in a table with 3 columns, the name of the note and then 2 buttons to either edit/open or delete them. Annoyingly there is an issue where when you save a note it goes straight to the bottom of the list, my theory for this happening is that it removes the original note and then appends the new version to the bottom of notes.txt which messes with the order of display. The notifications page allows you to change how often you get notifications for tasks you still need to do but other than that it does absolutely nothing, I didn't bother making a whole notification system because of how useless it would have been for the assignment, I just thought it would be another feature to improve user experience.\n\nOverall I'm pretty happy with this website especially since I got full marks for the university assignment and as it was my first time using a framework for web development. There are some features I would change or redo mainly to make it more efficient and clean, mainly with data handling as I think by adding for loops I could just go through the data and quickly edit or I could learn the switch case method rather than manually checking one by one. Another feature I wish I had the time to implement was an actual calendar with tasks on rather than using a table, the main motivation behind a calendar was because I saw someone implement google maps into their app so I thought it would be cool to do something similar with google calendar or another calendar.",
      "skills": [
        "HTML",
        "CSS",
        "Flask",
        "Object-Oriented Programming",
        "Form handling"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/productivity-app.png",
        "../assets/thumbnails/projectspictures/productivity-app-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/Productivity-app",
      "slugUrl": "productivity-app"
    },
    {
      "id": 4,
      "name": "Pong",
      "date": "2025",
      "fullDescription": "Made this during my second year as a fun side project, I hadn't done much programming in Python in a good couple of months so I figured I would do one in PyGame as it's something I knew I would enjoy, I ended up making my own interpretation of Pong, one of the first successful videogames that changed gaming, mainly because I thought it would be a good start to a bigger project as I could think of features along the journey.\n\nI started off simple by setting up the main game screen with a few basic shapes, such as the paddles and the ball. At first, there was a bit of a relearning curve in understanding how PyGame handles its rendering loop, but once the basics were in place, it became a lot of fun to see the game slowly take form. This foundation made it much easier to explore and implement additional PyGame functionality across the project such as movement.\n\nOne aspect of the project I wanted to focus on from the start was keeping everything organized and modular. To achieve this, I divided all the key components into separate files. Each class I made whether it was the ball or the players was placed in its own file for efficiency, and I structured the code in a way that made each component easily importable. The same approach was used for the screens; the main menu, the settings screen, and the pause screen were all written individually and tied together using a game manager file. While this organization took a bit of extra planning, it saved me a lot of time later when I wanted to debug or add features.\n\nThis was slightly confusing at first when deciding how and where to store each file and object, especially since you can't both objects at the same time otherwise you would get stuck in a deadlock meaning the game would crash.\n\nThe game included several different screens to improve the user experience. When the program is first launched, players are greeted with a main menu where they can start the game, access the settings, or exit. I added functionality to the settings screen so that players could toggle a colorblind mode for accessibility, something I wanted to include to make the game more inclusive. There was also a pause screen that allowed players to take a break and resume the game later without affecting their score. These features made the game feel more polished and interactive.\n\nOne of the highlights of the project was developing the computer for the enemy player. This involved creating an algorithm for the enemy to calculate the trajectory of the ball and position itself accordingly. At first, it was too precise and unbeatable, which made the game frustrating to play and this was because I made the y coordinate just constantly follow the ball. To balance things out, I introduced a cap on the enemy movement speed and reaction time, making it feel more human and challenging without being impossible. Tweaking these parameters took some time, but the end result allowed for an enjoyable single-player experience.\n\nAdding unique personal touches to the game was one of my favourite parts. For example, I included a brief “PONG” introduction screen that displays every time the program is loaded as a nod to the game's classic origins. It was a simple but fun touch that gave the project more personality.\n\nReflecting on the design, I think the visuals were clean and straightforward, relying primarily on PyGame's shape-drawing functions. Animations for the ball and paddle movements added flow, and the scoring system made gameplay rewarding. While I'm happy with how it turned out, I wish I'd spent more time experimenting with the aesthetic side of things, like trying out different themes and tweaking the colourblind setting or customizing the paddles and ball with unique designs.\n\nOverall, I'm incredibly proud of this project, taught me a lot about how to structure code for larger projects and gave me a chance to work on a fun, interactive experience. There are definitely areas I'd improve, like refining the visuals further or implementing online multiplayer functionality, but I'm happy with what I achieved and excited to build on these lessons in future projects.",
      "skills": [
        "Python",
        "PyGame",
        "Object-Oriented Programming",
        "Enemy Computer"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/pong-image.png",
        "../assets/thumbnails/projectspictures/pong-image-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/Pong",
      "slugUrl": "pong"
    },
    {
      "id": 5,
      "name": "Gratithink (Website)",
      "date": "2nd Year (2025)",
      "fullDescription": "GratiThink is a web and mobile app that helps students build a positive mindset through daily gratitude journaling. It encourages users to reflect on meaningful moments, track their progress, and develop a habit of mindfulness in an easy-to-use, student-friendly interface.\nThe project was developed using HTML, CSS, PHP, and JavaScript for the website and React.js for the mobile version. It showcases full-stack development skills and thoughtful design focused on simplicity, accessibility, and personal growth.",
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "Wireframes",
        "Responsive Design",
        "PHP"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/gratithink-webimage.png",
        "../assets/thumbnails/projectspictures/gratithink-webimage-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/GratiThink-Website,https://github.com/SameerUH/Gratithink-app",
      "slugUrl": "gratithink-website"
    },
    {
      "id": 6,
      "name": "Gratithink (App)",
      "date": "2nd Year (2025)",
      "fullDescription": "GratiThink is a web and mobile app that helps students build a positive mindset through daily gratitude journaling. It encourages users to reflect on meaningful moments, track their progress, and develop a habit of mindfulness in an easy-to-use, student-friendly interface.\nThe project was developed using HTML, CSS, PHP, and JavaScript for the website and React.js for the mobile version. It showcases full-stack development skills and thoughtful design focused on simplicity, accessibility, and personal growth.",
      "skills": [
        "HTML",
        "JavaScript",
        "React.js",
        "Tailwind CSS",
        "Wireframes",
        "Responsive Design"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/gratithink-appimage.png",
        "../assets/thumbnails/projectspictures/gratithink-appimage-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/GratiThink-Website,https://github.com/SameerUH/Gratithink-app",
      "slugUrl": "gratithink-app"
    },
    {
      "id": 7,
      "name": "Portfolio Site",
      "date": "3rd Year (2025)",
      "fullDescription": "The site you are looking at now.",
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "Three.js",
        "Wireframes",
        "Responsive Design",
        "Interactive shapes"
      ],
      "images": [
        "../assets/thumbnails/projectspictures/portfolio-image.png",
        "../assets/thumbnails/projectspictures/portfolio-image-2.png"
      ],
      "githubUrl": "https://github.com/SameerUH/Portfolio-website",
      "slugUrl": "portfolio"
    }
  ]
}